allwebtest.log
2019-11-12 00:32:09,359 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2019-11-12 00:32:09,389 INFO o.a.j.JMeter: Loading user properties from: /home/kate/apache-jmeter-5.1.1/bin/user.properties
2019-11-12 00:32:09,390 INFO o.a.j.JMeter: Loading system properties from: /home/kate/apache-jmeter-5.1.1/bin/system.properties
2019-11-12 00:32:09,397 INFO o.a.j.JMeter: Copyright (c) 1998-2019 The Apache Software Foundation
2019-11-12 00:32:09,397 INFO o.a.j.JMeter: Version 5.1.1 r1855137
2019-11-12 00:32:09,397 INFO o.a.j.JMeter: java.version=11.0.4
2019-11-12 00:32:09,398 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2019-11-12 00:32:09,398 INFO o.a.j.JMeter: os.name=Linux
2019-11-12 00:32:09,398 INFO o.a.j.JMeter: os.arch=amd64
2019-11-12 00:32:09,398 INFO o.a.j.JMeter: os.version=4.15.0-66-generic
2019-11-12 00:32:09,398 INFO o.a.j.JMeter: file.encoding=UTF-8
2019-11-12 00:32:09,399 INFO o.a.j.JMeter: java.awt.headless=null
2019-11-12 00:32:09,399 INFO o.a.j.JMeter: Max memory     =1073741824
2019-11-12 00:32:09,400 INFO o.a.j.JMeter: Available Processors =4
2019-11-12 00:32:09,412 INFO o.a.j.JMeter: Default Locale=English (EN)
2019-11-12 00:32:09,413 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2019-11-12 00:32:09,413 INFO o.a.j.JMeter: JMeterHome=/home/kate/apache-jmeter-5.1.1
2019-11-12 00:32:09,413 INFO o.a.j.JMeter: user.dir  =/home/kate/git
2019-11-12 00:32:09,414 INFO o.a.j.JMeter: PWD       =/home/kate/git
2019-11-12 00:32:09,414 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: k FullName: k
2019-11-12 00:32:09,420 INFO o.a.j.s.FileServer: Default base='/home/kate/git'
2019-11-12 00:32:09,422 INFO o.a.j.s.FileServer: Set new base='/home/kate/git'
2019-11-12 00:32:09,630 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2019-11-12 00:32:09,655 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2019-11-12 00:32:09,660 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2019-11-12 00:32:09,666 INFO o.a.j.s.SaveService: Loading file: allwebtest.jmx
2019-11-12 00:32:09,730 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2019-11-12 00:32:09,730 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2019-11-12 00:32:09,730 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2019-11-12 00:32:09,730 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2019-11-12 00:32:09,730 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2019-11-12 00:32:09,731 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2019-11-12 00:32:09,799 INFO o.a.j.JMeter: Creating summariser <summary>
2019-11-12 00:32:09,808 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2019-11-12 00:32:09,812 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2019-11-12 00:32:09,813 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2019-11-12 00:32:09,830 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2019-11-12 00:32:09,830 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2019-11-12 00:32:10,428 INFO o.a.j.JMeter: Running test (1573489930428)
2019-11-12 00:32:10,432 INFO o.a.j.e.StandardJMeterEngine: Starting setUp thread groups
2019-11-12 00:32:10,432 INFO o.a.j.e.StandardJMeterEngine: Starting setUp ThreadGroup: 1 : funcblackbox  
2019-11-12 00:32:10,432 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group funcblackbox .
2019-11-12 00:32:10,432 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2019-11-12 00:32:10,433 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2019-11-12 00:32:10,440 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2019-11-12 00:32:10,441 INFO o.a.j.e.StandardJMeterEngine: Starting setUp ThreadGroup: 2 : apiwhitebox  
2019-11-12 00:32:10,442 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group apiwhitebox .
2019-11-12 00:32:10,442 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2019-11-12 00:32:10,442 INFO o.a.j.t.ThreadGroup: Starting thread group... number=2 threads=1 ramp-up=1 delayedStart=false
2019-11-12 00:32:10,444 INFO o.a.j.t.ThreadGroup: Started thread group number 2
2019-11-12 00:32:10,445 INFO o.a.j.e.StandardJMeterEngine: Starting setUp ThreadGroup: 3 : integraregre 
2019-11-12 00:32:10,446 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group integraregre.
2019-11-12 00:32:10,446 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2019-11-12 00:32:10,446 INFO o.a.j.t.ThreadGroup: Starting thread group... number=3 threads=1 ramp-up=1 delayedStart=false
2019-11-12 00:32:10,448 INFO o.a.j.t.ThreadGroup: Started thread group number 3
2019-11-12 00:32:10,448 INFO o.a.j.e.StandardJMeterEngine: Starting setUp ThreadGroup: 4 : stress 
2019-11-12 00:32:10,448 INFO o.a.j.e.StandardJMeterEngine: Starting 5 threads for group stress.
2019-11-12 00:32:10,453 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2019-11-12 00:32:10,454 INFO o.a.j.t.ThreadGroup: Starting thread group... number=4 threads=5 ramp-up=1 delayedStart=false
2019-11-12 00:32:10,457 INFO o.a.j.t.JMeterThread: Thread started: integraregre 3-1
2019-11-12 00:32:10,466 INFO o.a.j.t.JMeterThread: Thread started: apiwhitebox  2-1
2019-11-12 00:32:10,469 INFO o.a.j.t.JMeterThread: Thread started: funcblackbox  1-1
2019-11-12 00:32:10,470 INFO o.a.j.t.JMeterThread: Thread started: stress 4-1
2019-11-12 00:32:10,475 INFO o.a.j.t.ThreadGroup: Started thread group number 4
2019-11-12 00:32:10,475 INFO o.a.j.e.StandardJMeterEngine: Waiting for all setup thread groups to exit
2019-11-12 00:32:10,499 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = k
2019-11-12 00:32:10,513 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2019-11-12 00:32:10,516 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2019-11-12 00:32:10,516 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2019-11-12 00:32:10,516 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2019-11-12 00:32:10,517 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2019-11-12 00:32:10,673 INFO o.a.j.t.JMeterThread: Thread started: stress 4-2
2019-11-12 00:32:10,723 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2019-11-12 00:32:10,735 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2019-11-12 00:32:10,736 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2019-11-12 00:32:10,846 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2019-11-12 00:32:10,851 INFO o.a.j.u.SSLManager: KeyStore created OK
2019-11-12 00:32:10,851 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2019-11-12 00:32:10,864 INFO o.a.j.t.JMeterThread: Thread started: stress 4-3
2019-11-12 00:32:11,067 INFO o.a.j.t.JMeterThread: Thread started: stress 4-4
2019-11-12 00:32:11,263 INFO o.a.j.t.JMeterThread: Thread started: stress 4-5
2019-11-12 00:32:11,812 INFO o.a.j.t.JMeterThread: Thread is done: apiwhitebox  2-1
2019-11-12 00:32:11,812 INFO o.a.j.t.JMeterThread: Thread finished: apiwhitebox  2-1
2019-11-12 00:32:12,234 INFO o.a.j.t.JMeterThread: Thread is done: funcblackbox  1-1
2019-11-12 00:32:12,235 INFO o.a.j.t.JMeterThread: Thread finished: funcblackbox  1-1
2019-11-12 00:32:12,342 INFO o.a.j.t.JMeterThread: Thread is done: stress 4-3
2019-11-12 00:32:12,342 INFO o.a.j.t.JMeterThread: Thread finished: stress 4-3
2019-11-12 00:32:12,471 INFO o.a.j.t.JMeterThread: Thread is done: stress 4-1
2019-11-12 00:32:12,472 INFO o.a.j.t.JMeterThread: Thread finished: stress 4-1
2019-11-12 00:32:12,541 INFO o.a.j.t.JMeterThread: Thread is done: stress 4-2
2019-11-12 00:32:12,541 INFO o.a.j.t.JMeterThread: Thread finished: stress 4-2
2019-11-12 00:32:12,550 INFO o.a.j.t.JMeterThread: Thread is done: stress 4-5
2019-11-12 00:32:12,550 INFO o.a.j.t.JMeterThread: Thread finished: stress 4-5
2019-11-12 00:32:12,552 INFO o.a.j.t.JMeterThread: Thread is done: stress 4-4
2019-11-12 00:32:12,552 INFO o.a.j.t.JMeterThread: Thread finished: stress 4-4
2019-11-12 00:32:12,837 INFO o.a.j.t.JMeterThread: Thread is done: integraregre 3-1
2019-11-12 00:32:12,838 INFO o.a.j.t.JMeterThread: Thread finished: integraregre 3-1
2019-11-12 00:32:12,841 INFO o.a.j.e.StandardJMeterEngine: All Setup Threads have ended
2019-11-12 00:32:12,892 INFO o.a.j.e.StandardJMeterEngine: No enabled thread groups found
2019-11-12 00:32:12,893 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2019-11-12 00:32:12,894 INFO o.a.j.r.Summariser: summary =     16 in 00:00:02 =    6.5/s Avg:   804 Min:   199 Max:  1484 Err:     1 (6.25%)